{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"rich_text_gkBid4":{"type":"rich-text","blocks":{"heading_m3zUVq":{"type":"heading","settings":{"heading":"<strong>We’re Here For Anything You Need.<\/strong>","heading_size":"h1"}},"text_K8a7g8":{"type":"text","settings":{"text":"<h3>Whether you have a question about your order or want advice on what to buy for your home, our team is here to help with all things Snowe.<\/h3><h3><\/h3><h3>Get in touch.<\/h3>"}}},"block_order":["heading_m3zUVq","text_K8a7g8"],"name":"t:sections.rich-text.presets.name","settings":{"desktop_content_position":"center","content_alignment":"center","color_scheme":"scheme-2","full_width":true,"padding_top":40,"padding_bottom":52}},"rich_text_3eyniL":{"type":"rich-text","blocks":{"text_nYcBBe":{"type":"text","settings":{"text":"<p><strong>hello@snowehome.com<\/strong><\/p><p>We’re looking forward to hearing from you! Our team is responding to your emails from 9am - 5pm EST, Monday through Friday — save for US federal holidays. The evolving situation surrounding the global supply chain has resulted in increased email volume for our team, but we’ll do our best to respond within 5-7 business days. We appreciate your patience!<\/p>"}}},"block_order":["text_nYcBBe"],"name":"t:sections.rich-text.presets.name","settings":{"desktop_content_position":"center","content_alignment":"center","color_scheme":"","full_width":true,"padding_top":40,"padding_bottom":52}},"rich_text_mdMYUy":{"type":"rich-text","blocks":{"heading_ikXhXw":{"type":"heading","settings":{"heading":"Supply Chain Update","heading_size":"h1"}},"text_3Vqqe4":{"type":"text","settings":{"text":"<p>As you might have heard, global supply chains are stretched thin. Luckily, we're prepped and ready. For <strong>in-stock items<\/strong>, rest assured, your shipment will be on its way ASAP! However, with an unprecedented increase in demand, please note that carriers are experiencing delays.<\/p><p>For <strong>pre-ordered products<\/strong>, you can expect your product to ship by the date listed at the time of purchase. If an unanticipated delay occurs, our team will keep you in the know!<\/p>"}}},"block_order":["heading_ikXhXw","text_3Vqqe4"],"name":"t:sections.rich-text.presets.name","settings":{"desktop_content_position":"center","content_alignment":"center","color_scheme":"scheme-38f15517-cbab-4eeb-ae01-f3cd174be429","full_width":true,"padding_top":40,"padding_bottom":52}},"rich_text_6LcLTn":{"type":"rich-text","blocks":{"heading_zHEVGf":{"type":"heading","settings":{"heading":"The Care Guide","heading_size":"h1"}},"text_fhrxDU":{"type":"text","settings":{"text":"<p>We design for simplicity and engineer to last, but even true homebodies need the inside scoop. Visit our Care Guide for tips and tricks to keep your essentials looking sparkly for years to come.<\/p>"}},"button_yDrgyB":{"type":"button","settings":{"button_label":"VISIT THE CARE GUIDE","button_link":"","button_style_secondary":false,"button_label_2":"","button_link_2":"","button_style_secondary_2":false}}},"block_order":["heading_zHEVGf","text_fhrxDU","button_yDrgyB"],"name":"t:sections.rich-text.presets.name","settings":{"desktop_content_position":"center","content_alignment":"center","color_scheme":"scheme-e42044bf-0b53-459e-95dd-36c9ad7c1594","full_width":true,"padding_top":40,"padding_bottom":24}},"collapsible_content_LqnMH3":{"type":"collapsible-content","blocks":{"collapsible_row_rERU8G":{"type":"collapsible_row","settings":{"heading":"How much does Snowe charge for shipping?","icon":"none","row_content":"<p>All Snowe orders include a $5 flat-rate shipping charge. Please note that outbound shipping charges are non-refundable.<\/p><p>The return shipping fee of $9.99 will automatically be deducted from your refund.<\/p>","page":""}},"collapsible_row_XByTDK":{"type":"collapsible_row","settings":{"heading":"What is a preorder, and when will my order ship?","icon":"none","row_content":"<p>We offer some products for sale before they’re ready to ship from our warehouse. Not to worry though, any preordered items will be shipped out by the date shown on the item’s product page, if not sooner.<\/p><p>Once you’ve placed your preorder, you will also see your expected delivery date shown in your order confirmation email. We’ll also send you a shipping confirmation email once your preorder leaves our warehouse.<\/p>","page":""}},"collapsible_row_JnwtmR":{"type":"collapsible_row","settings":{"heading":"How do I use a promo code?","icon":"none","row_content":"<p>Promo codes or gift cards can be applied at checkout (promotions that do not require a code will automatically apply). Codes must be entered prior to completing an order and cannot be applied to multiple or previous orders. Promo codes cannot be combined and are not transferable or redeemable for cash or credit. Promo codes cannot be used to purchase gift cards or event tickets.<\/p>","page":""}},"collapsible_row_chYaAA":{"type":"collapsible_row","settings":{"heading":"How do referrals work? (Give $35, Get $35)","icon":"none","row_content":"<p>Spread the word and save! You can send referral discounts using our referral panelonce you have created an account. Every friend you refer will receive a $35 discount off their first order (must be $100+). After a qualifying purchase is made using your referral code, you’ll automatically receive a $35 off code to use the next time you shop. <br\/><br\/>Please note a referral may be blocked for a variety of reasons including suspected fraud. If you believe your referral was mistakenly blocked, please contact <span style=\"text-decoration:underline\">hello@snowehome.com<\/span>. You can see the full terms & conditions of our referral program here.<br\/><br\/><\/p>","page":""}},"collapsible_row_GEmJyY":{"type":"collapsible_row","settings":{"heading":"How do I use Klarna to buy now and pay later?","icon":"none","row_content":"<p>We’ve partnered with Klarna to allow you to split your purchase into 4 interest-free payments. Add your items to cart as you normally would, then in Checkout select “Buy now, pay later with Klarna” at the Payment stage. Enter the credit or debit card of your choice for automatic payments every two weeks. There is no interest or added fees when you pay on time.<\/p><p>To learn more about Klarna and how it works, please visit our Klarna page here.<\/p>","page":""}},"collapsible_row_b63yfB":{"type":"collapsible_row","settings":{"heading":"Can I send Snowe as a gift?","icon":"none","row_content":"<p>It’s simple to send Snowe to a friend or loved one. When you place your order, select the box that reads “Add Gift Receipt and Message” at checkout to let our team know it’s a gift. We’ll include a gift receipt and a handwritten gift note. <em>Please note: This is unavailable for Snowe x Afloral products.<\/em><\/p><p>For a special touch, select the box that reads “Add Gift Wrapping” at checkout, and we will box and wrap your order with our signature striped kraft wrapping paper. Our team will tie the box with a black grosgrain ribbon so it looks extra special. We do charge a non-refundable $8 fee for Gift Wrapping. <em>Please note: Due to shape, Gift Wrapping is unavailable for pillows, comforters, bed wraps, mattress pads, and Snowe x Afloral products.<\/em><\/p>","page":""}},"collapsible_row_8xqfzg":{"type":"collapsible_row","settings":{"heading":"I live outside of the contiguous United States. Can I place an order?","icon":"none","row_content":"<p>Snowe is unfortunately unable to support international orders at this time.<\/p><p>We do support domestic shipments to non-contiguous US states, territories, or APO boxes, for a slight additional shipping charge. Please reach out to our team at <span style=\"text-decoration:underline\">hello@snowehome.com<\/span> for more details!<\/p>","page":""}},"collapsible_row_76nWLp":{"type":"collapsible_row","settings":{"heading":"Can I edit my order?","icon":"none","row_content":"<p>Though our team will do our best to accommodate any adjustments when possible, once payment has been completed for an order, we’re unable to guarantee any order edits or shipping address changes. Please carefully review these details at check-out when placing your order.<\/p><p>Once orders are fulfilled and shipped we can’t modify or cancel them, but we do offer free returns and exchanges within our 14 Day Snowe Promise if you aren’t happy with your purchase. Please reach out to <span style=\"text-decoration:underline\">hello@snowehome.com<\/span> with any requests or concerns and we’ll help however we can!<\/p>","page":""}},"collapsible_row_XRkMhn":{"type":"collapsible_row","settings":{"heading":"How can I keep track of my orders?","icon":"none","row_content":"<p>If you’ve set up a <span style=\"text-decoration:underline\">Snowe Account<\/span>, you can view all of your Snowe orders once you’ve logged in, complete with tracking information, past order invoices, and your rewards information!<\/p><p>If you like using <span style=\"text-decoration:underline\">Shop App from Shopify<\/span> to manage your online purchases, you can also access your Snowe order information and shipment tracking through the app.<\/p>","page":""}},"collapsible_row_LD67qk":{"type":"collapsible_row","settings":{"heading":"What happens to my discount if I return an item?","icon":"none","row_content":"<p>If making an exchange, we’ll be happy to transfer an original promotional discount to your new exchange order within the terms of the discount. For partial returns on discounted orders and bundles, your refund may be adjusted if the remaining order value no longer qualifies for the original discount.<\/p>","page":""}},"collapsible_row_k8bQQF":{"type":"collapsible_row","settings":{"heading":"How do I create a Snowe account?","icon":"none","row_content":"<p>If you haven’t registered yet, you can <span style=\"text-decoration:underline\">create an account here<\/span>. You can use your Snowe account to view your order history, tracking information, rewards point balance, and manage your customer information.<br\/><br\/><\/p>","page":""}},"collapsible_row_eJPNbj":{"type":"collapsible_row","settings":{"heading":"How do I reset my account password?","icon":"none","row_content":"<p>We forget ours all the time too. Click on the “<span style=\"text-decoration:underline\">Forgot your password<\/span>\" link in the My Account section of our website to reset your password. If you run into any issues, reach out to us at <span style=\"text-decoration:underline\">hello@snowehome.com <\/span>and we’d be happy to help!<br\/><br\/><\/p>","page":""}},"collapsible_row_zf7kcN":{"type":"collapsible_row","settings":{"heading":"How do I find out about new products?","icon":"none","row_content":"<p>To stay in the loop on all things Snowe, just sign up for our email newsletter. You can do this when you <span style=\"text-decoration:underline\">create an account<\/span>, or sign up later in the footer of our website. We’ll keep you posted about upcoming products, events, and other tips for your home.<\/p>","page":""}},"collapsible_row_Q3BEtU":{"type":"collapsible_row","settings":{"heading":"Should I wash my product before using?","icon":"none","row_content":"<p>All of our Products are carefully inspected before fulfillment for quality assurance, and though they should arrive in clean condition, we do suggest cleaning your items before use with our Care G<span style=\"text-decoration:underline\"> <\/span>in mind.<br\/><br\/><\/p>","page":""}}},"block_order":["collapsible_row_rERU8G","collapsible_row_XByTDK","collapsible_row_JnwtmR","collapsible_row_chYaAA","collapsible_row_GEmJyY","collapsible_row_b63yfB","collapsible_row_8xqfzg","collapsible_row_76nWLp","collapsible_row_XRkMhn","collapsible_row_LD67qk","collapsible_row_k8bQQF","collapsible_row_eJPNbj","collapsible_row_zf7kcN","collapsible_row_Q3BEtU"],"name":"t:sections.collapsible_content.presets.name","settings":{"caption":"","heading":"Ordering","heading_size":"h1","heading_alignment":"left","layout":"none","container_color_scheme":"scheme-1","color_scheme":"scheme-1","open_first_collapsible_row":false,"image_ratio":"adapt","desktop_layout":"image_second","padding_top":36,"padding_bottom":36}},"collapsible_content_Y6nnye":{"type":"collapsible-content","blocks":{"collapsible_row_L3WVMc":{"type":"collapsible_row","settings":{"heading":"What does my tracking information mean?","icon":"none","row_content":"<p>My tracking information says:<\/p><p><strong>Nothing<\/strong> - Tracking numbers are created when an order is passed off from Snowe’s warehouse to the shipping carrier. It can take up to 24 hours for the carrier to update the system with its next location. Rest assured that your order is on its way!<\/p><p><strong>“Pending” or “In Transit”<\/strong> - You can reach out to your carrier directly to get a localized update (USPS). Often they are able to provide more up-to-date details than we are! Please note that with the unprecedented increase in demand, though, carriers have been experiencing delays.<\/p><p><strong>“Delivered” (but I don’t have it!)<\/strong> - As a first step, we recommend double checking the shipping address of your order. If that’s correct, try also looking in areas around your address that you may not expect. We’ve had plenty of customers find their orders on the side of their building, by a garage, with neighbors, and even hidden in bushes!<\/p><p>Occasionally, carriers will mark a package as “delivered” a bit too early. If the status changed to “delivered” within the last 48 hours, there is a good chance your order will arrive safely today or tomorrow. You can also reach out to the carrier directly to get a localized update (USPS). If your order still has not arrived after 48 hours, please reach out to us.<\/p>","page":""}},"collapsible_row_CUAnkV":{"type":"collapsible_row","settings":{"heading":"When can I expect my order to arrive?","icon":"none","row_content":"<p>Orders will arrive within 2-7 business days after the order has been shipped. For items that are pre-ordered, once the item is available for fulfillment, it will follow the same shipping timeline.<\/p>","page":""}},"collapsible_row_mEKy8q":{"type":"collapsible_row","settings":{"heading":"What’s the difference between a preordered item and a waitlisted item?","icon":"none","row_content":"<p>If an item is not available to ship, it may be available for preorder and the expected “Ships By” date will be displayed on the item’s Product Page. Your preordered item(s) will leave our warehouse on or near the estimated “Ships by” date on your order confirmation email. Please note that payment is accepted in full for any preordered item at the time of purchase.<\/p><p>If an out of stock item is not available for preorder, there may be a “waitlist” available on the product page. Add your email to the waitlist to receive an update when the item is available for purchase.<\/p>","page":""}},"collapsible_row_WnGzqr":{"type":"collapsible_row","settings":{"heading":"Where is my order?","icon":"none","row_content":"<p>You’ll receive a shipping confirmation email with tracking information once your order is processed to ship, but if you are curious about the status of a recent order, you can also <span style=\"text-decoration:underline\">create an account <\/span>and view your order history and tracking information in your <span style=\"text-decoration:underline\">account dashboard<\/span>.<\/p>","page":""}},"collapsible_row_zht49k":{"type":"collapsible_row","settings":{"heading":"Which carrier will my order ship with?","icon":"none","row_content":"<p>Your order will ship via USPS. For delivery support, you can <span style=\"text-decoration:underline\">manage your mail <\/span>with USPS.<\/p>","page":""}},"collapsible_row_FiPGU9":{"type":"collapsible_row","settings":{"heading":"What do I do if my shipment arrives damaged?","icon":"none","row_content":"<p>We do our best to cushion all shipments with sturdy, yet sustainable materials, but surprise damage can occasionally occur in transit. If you receive a damaged item, please contact our team at <span style=\"text-decoration:underline\">hello@snowehome.com<\/span> with photos and a description of what happened for our quality assurance purposes, and we’ll happily help with any necessary replacements!<\/p><p><em>* For items from <\/em><span style=\"text-decoration:underline\"><em>The Every Edit<\/em><\/span><em>, please allow an additional 3-5 business days for us to work with our partners and get back to you with the best next steps.<\/em><\/p>","page":""}}},"block_order":["collapsible_row_L3WVMc","collapsible_row_CUAnkV","collapsible_row_mEKy8q","collapsible_row_WnGzqr","collapsible_row_zht49k","collapsible_row_FiPGU9"],"name":"t:sections.collapsible_content.presets.name","settings":{"caption":"","heading":"Shipping","heading_size":"h1","heading_alignment":"left","layout":"none","container_color_scheme":"scheme-1","color_scheme":"scheme-1","open_first_collapsible_row":false,"image_ratio":"adapt","desktop_layout":"image_second","padding_top":36,"padding_bottom":36}},"collapsible_content_WrFLPb":{"type":"collapsible-content","blocks":{"collapsible_row_izNGQF":{"type":"collapsible_row","settings":{"heading":"What is Snowe’s return policy?","icon":"none","row_content":"<p>We’re obsessed with quality. So we can promise you the moon– or 2 of ‘em to be exact.You can return items within 14 days of purchase if unusedand if you’re not 100% satisfied, we’ll be happy to help with a return, exchange, or replacement. This label is pre-paid and pre-addressed. The return shipping fee of $9.99 will automatically be deducted from your refund. Refunds will be issued to the original method of payment.<\/p>","page":""}},"collapsible_row_pNgbth":{"type":"collapsible_row","settings":{"heading":"Don’t have a printer?","icon":"none","row_content":"<p>All return shipping labels are issued via email as a pdf. If you can’t print at home, most UPS locations can print shipping labels for a small fee, or local libraries can offer an affordable printing alternative.<\/p>","page":""}},"collapsible_row_KCJXgx":{"type":"collapsible_row","settings":{"heading":"Collapsible row","icon":"none","row_content":"<p>You can return a gift you’ve received for store credit within our 14 Day Snowe Promise, starting on the date of delivery. Email us at hello@snowehome.com and refer to your order number from your gift receipt. We’ll help you from there.<\/p><p>Registry gifts can also be returned or exchanged within our 14 Day Snowe Promise. Just reach out to <span style=\"text-decoration:underline\">hello@snowehome.com<\/span>.<\/p>","page":""}}},"block_order":["collapsible_row_izNGQF","collapsible_row_pNgbth","collapsible_row_KCJXgx"],"name":"t:sections.collapsible_content.presets.name","settings":{"caption":"","heading":"Returns \/ Exchanges","heading_size":"h1","heading_alignment":"left","layout":"none","container_color_scheme":"scheme-1","color_scheme":"scheme-1","open_first_collapsible_row":false,"image_ratio":"adapt","desktop_layout":"image_second","padding_top":36,"padding_bottom":36}},"collapsible_content_aCaEig":{"type":"collapsible-content","blocks":{"collapsible_row_gYCBKP":{"type":"collapsible_row","settings":{"heading":"How long is my completion discount on unpurchased items available?","icon":"none","row_content":"<p>You’ll save 15% on all unpurchased items, plus any additional products you decide to add to your registry for up to 6 months after your big day (valid as a single purchase). Just reach out to our team at <span style=\"text-decoration:underline\">registry@snowehome.com <\/span>when you’re ready.<\/p>","page":""}},"collapsible_row_DcK9c7":{"type":"collapsible_row","settings":{"heading":"Can I get help building my Snowe Registry?","icon":"none","row_content":"<p>We’re always here to help. Send an email to registry@snowehome.com with any questions or to set up a free consultation with one of our registry experts.<\/p>","page":""}},"collapsible_row_wJGwnM":{"type":"collapsible_row","settings":{"heading":"How can I keep track of my gifts and guests' details?","icon":"none","row_content":"<p>We provide a Thank You Manager for all of our registrants. You can access the Thank You Manager in your Snowe account any time after you create a Snowe registry by following these steps:<\/p><ol><li>Log into your <span style=\"text-decoration:underline\">Customer Account<\/span><\/li><li>Navigate to the <span style=\"text-decoration:underline\">Registry system<\/span> and click “<span style=\"text-decoration:underline\">Manage Your Registry<\/span>”<\/li><li>Click “Edit Registry”<\/li><li>Click “Thank you Manager” below the Snowe logo at the top of the window<\/li><\/ol><p>Within the Thank You Manager, you can track each gift and your guests’ mailing details, making your job writing thank you notes a breeze.<\/p>","page":""}},"collapsible_row_FJPwBc":{"type":"collapsible_row","settings":{"heading":"How do I create a Registry?","icon":"none","row_content":"<p>Once you have created your Snowe account, sign in, click “Create Your Registry” under the Registry navigation bar menu, and follow the instructions. Use our Registry Builder to guide you through the most important purchases for your registry. From setting the perfect table to deciding how many guest towels you’ll want to have on hand, we’ve got you covered.<\/p>","page":""}},"collapsible_row_jgzD9f":{"type":"collapsible_row","settings":{"heading":"I haven’t received a gift that I'm expecting. Why haven’t I received it yet?","icon":"none","row_content":"<p>Your gift may be in transit. If for any reason an item that was gifted to you is delayed, we’ll promptly notify you. If you are concerned about not receiving a gift, please contact us at <span style=\"text-decoration:underline\">registry@snowehome.com<\/span>.<br\/><br\/><\/p>","page":""}},"collapsible_row_zHAj3P":{"type":"collapsible_row","settings":{"heading":"How do I change any of my account information (shipping address, event date, etc.)?","icon":"none","row_content":"<p>You can change your account information at any time. Navigate to “Manage Your Registry” under the Registry navigation bar menu and click “Edit Registry”. Once there, click ‘Account’ in the registry bar in order to edit your information.<\/p>","page":""}},"collapsible_row_pGMCGg":{"type":"collapsible_row","settings":{"heading":"How long will my Registry be available after my event date?","icon":"none","row_content":"<p>You can access your Registry for 2 years from the date you create it. If you need more time, please contact us at registry@snowehome.com.<\/p>","page":""}},"collapsible_row_NrtVcb":{"type":"collapsible_row","settings":{"heading":"Can you hold my gifts and ship them to me when I’m ready?","icon":"none","row_content":"<p>Absolutely. When you create your Registry, you can specify a ‘Hold Gifts Until’ date. All orders placed for your registry will not be processed to ship until this set date.<\/p>","page":""}},"collapsible_row_rhLmjQ":{"type":"collapsible_row","settings":{"heading":"I live outside the Contiguous U.S., can I still create a Snowe Registry?","icon":"none","row_content":"<p>Yes! Snowe ships to Alaska, Hawaii, and U.S territories upon request (additional shipping charges may apply). Please reach out to us at <span style=\"text-decoration:underline\">registry@snowehome.com<\/span>, and we'd be happy to determine the best shipping options.<\/p>","page":""}},"collapsible_row_9HtxWd":{"type":"collapsible_row","settings":{"heading":"How will guests know where the gifts should ship to?","icon":"none","row_content":"<p>The address you provide while creating your registry will automatically populate when your guests complete your order. <\/p>","page":""}},"collapsible_row_X3q8af":{"type":"collapsible_row","settings":{"heading":"Can my guests give my gifts in person if they prefer?","icon":"none","row_content":"<p>If your guests would like to hand-deliver their purchases, they can adjust the shipping address during checkout to have their purchases shipped to them.<\/p>","page":""}}},"block_order":["collapsible_row_gYCBKP","collapsible_row_DcK9c7","collapsible_row_wJGwnM","collapsible_row_FJPwBc","collapsible_row_jgzD9f","collapsible_row_zHAj3P","collapsible_row_pGMCGg","collapsible_row_NrtVcb","collapsible_row_rhLmjQ","collapsible_row_9HtxWd","collapsible_row_X3q8af"],"name":"t:sections.collapsible_content.presets.name","settings":{"caption":"","heading":"Registry","heading_size":"h1","heading_alignment":"left","layout":"none","container_color_scheme":"scheme-1","color_scheme":"scheme-1","open_first_collapsible_row":false,"image_ratio":"adapt","desktop_layout":"image_second","padding_top":36,"padding_bottom":36}},"collapsible_content_rBDxfr":{"type":"collapsible-content","blocks":{"collapsible_row_dzWKkP":{"type":"collapsible_row","settings":{"heading":"Who can I reach out to about press opportunities?","icon":"none","row_content":"<p>We would love to hear from you! Please email us at <span style=\"text-decoration:underline\">press@snowehome.com <\/span>with the relevant details, and a member of our team will get back to you.<\/p>","page":""}}},"block_order":["collapsible_row_dzWKkP"],"name":"t:sections.collapsible_content.presets.name","settings":{"caption":"","heading":"Press Inquiries","heading_size":"h1","heading_alignment":"left","layout":"none","container_color_scheme":"scheme-1","color_scheme":"scheme-1","open_first_collapsible_row":false,"image_ratio":"adapt","desktop_layout":"image_second","padding_top":36,"padding_bottom":36}}},"order":["main","rich_text_gkBid4","rich_text_3eyniL","rich_text_mdMYUy","rich_text_6LcLTn","collapsible_content_LqnMH3","collapsible_content_Y6nnye","collapsible_content_WrFLPb","collapsible_content_aCaEig","collapsible_content_rBDxfr"]}